<template>
    <mNav></mNav>
    <div class="blockChain">
        <h2>区块链四大特点</h2>
        <p class="strong"><img src="@/assets/svg/overview.svg" alt="">概述</p>
        <p>区块链是一个信息技术领域的术语。从本质上讲，它是一个共享数据库，或称之为公共账本，其每一个区块记录一段时间内产生的转账等一些其他信息。</p>
        <p>与传统账本的区别是，无论有没有新的交易产生，有没有新的帐目产生，区块都会按照约定的时间去出块，这就是区块的产生。如果这段时间没有新的交易产生，那产生的就是我们所谓的空块。</p>
        <p>同时，绝大多数区块链项目都会对区块加一个大小的限制，也就是说单个区块可以记录的最大信息的容量。</p>
        <p>举个例子，比特币的区块大小是1M，所以BTC的每个区块中最多能记录 大约3000笔的交易。如果矿工想打包更多的交易，那就不得不提高区块 的上限。</p>
        <p class="strong"><img src="@/assets/svg/special.svg" alt="">基本特点</p>
        <p class="strong"><img src="@/assets/svg/special1.svg" alt="">第一个特点，匿名性。</p>
        <p>匿名性是指个人在去个性化的群体中隐藏自己个性的一种现象。</p>
        <p>区块链匿名性则是指别人无法知道你在区块链上有多少资产，以及和谁进行了转账，甚至是对隐私的信息进行匿名加密。</p>
        <p>1.匿名性有等级差别。</p> 
        <p>加密货币市场中，匿名性有以下几个等级:</p>
        <ul>
            <li>1.基本级;</li>
            <li>2.高级;</li>
            <li>3.极致级;</li>
        </ul>
        <p>我们最熟悉的比特币，其实他的匿名性只是最基本的级别。</p>
        <p>你在区块链网络上只能查到转账记录，但是不知道地址背后更多的信息。不过要是知道了地址背后对应的人是谁，也就暴露了所有相关的转账记录及资产信息。</p>
        <p>达世币和门罗币则做到了较为高级匿名性。</p>
        <p>即使你查到了此类产品转账地址背后的人是谁，也无法知道其他的信息。</p>
        <p>再上一层还有把匿名性做到极致级别的。</p>
        <p>例如，ZCASH，他苛刻的资产匿名性要求只有拥有私钥的人才能查到所有的转账信息。</p>
        <p>虽然比特币使用了非对称加密算法，但是交易仍会被所有节点所查看，所以，比特币仍然可以通过那些看似随机组成的字符串来找到交易的发起方和接收方。可见，比特币只是具有“半匿名性”的数字货币。</p>
        <p>2.大多数基于区块链技术的应用都有匿名性。</p>
        <p>除了资产方面的匿名性，大多数基于区块链技术的应用也具备匿名性，在隐私保护方面大有所为，例如投票、选举、隐私保护、艺术品拍卖等。</p>
        <p>通过区块链，我们可以查询到每一笔交易的数据信息，却无法得知交易者。</p>
        <p>比如，我们知道小币向小乎支付了1枚比特币，但是双方名字只是代号，所以无法 知道他们的真实身份。</p>
        <p>可见，区块链的匿名性特点，在一定程度上很好地保护了用户的隐私。但是区块链的匿名性也颇具争议，因为它在人们交易、隐私方面起到了重要的保护作用，也为一些违法犯罪行为提供了“保护伞”。</p>
        <img class="content-img" src="@/assets/img/qkltd1.png" alt="">
        <p class="strong"><img src="@/assets/svg/special2.svg" alt="">第二个特点，不可篡改。</p>
        <p>简单来说，就是说所有已经上链的交易不能被更改。</p>
        <p>在生活中大家接触最多的是数据库，数据库最基本的操作是增删改查，其中删除和修改就是对数据库中已有记录的信息进行变更。为了避免数据损坏，防止数据库被恶意修改，运维经常需要对数据库进行一个备份。</p>
        <p>而区块链的特点是其上面的数据是不可篡改的，这个不可篡改主要有两点来保证。</p>
        <p>第一点，所有每个区块都通过区块头中的哈希，与前面的区块紧紧的绑定在一起。</p>
        <img class="content-img" src="@/assets/img/special2.jpg" alt="">
        <p>在这样的设计下，单纯修改一个区块是没有意义的，因为所有区块都是连在一起的。假如第一个区块被修改了，那这个区块后面的所有区块都无法找到它的潜入区块。</p>
        <p>因为把这个区块的一个交易修改以后，整个区块的哈希就改变了，要想后面的区块都连起来，就必须把后面所有的区块都重新再产生一遍，这是几乎不可能的。难度非常非常大，这个难度为什么大我们后面会展开来说。</p>
        <p>第二点，所有的节点都保存了完整的区块数据。</p>
        <p>如果仅仅更改其中一个节点，或者其中一部分节点的数据，也不能改变全网的状态。因为全网中还有其他更多的节点是不被控制的，任何人无法去修改这些节点的数据</p>
        <p>通过这两点，保证了链上数据的不可更改。</p>
        <p class="strong"><img src="@/assets/svg/special3.svg" alt="">第三个特点，去中心化。</p>
        <p>区块链的去中心化区块链本质上是一个去中心化的分布式账本数据库</p>
        <p>即每个节点都有一个完整的账本，每个账本中都记录了从创始区块(高度为0的 区块)到现在所有的信息。</p>
        <p>而我们一般接触到的传统金融系统，是分级保管的，每级仅保管了本级以下的数据。例如，省级的分行不会保管其他省分行的数据。</p>
        <p>假设北京的分行需要访问上海分行的数据，他必须向上级，例如总行，去申请数据访问的授权。</p>
        <p>简单理解就是区块链的数据是分散的存储在网络中许多节点上的。而传统的数据 存储方式，则是存在网络中1个或几个大节点上的。由此看来，所谓的中心化与 去中心化，说白了就是存储数据的节点的多少的区别。</p>
        <p>所以，区块链的去中心化是相对的。数据只存在1个节点上，肯定就是中心化的。 但如果存在100个节点上，它们相对于1个节点就可以说是去中心化，只是去中心 化的程度不一样而已。</p>
        <img class="content-img" src="@/assets/img/qkl3.png" alt="">
        <p class="strong"><img src="@/assets/svg/special4.svg" alt="">第四个特点，可追溯。</p>
        <p>可追溯的意思是，任何人可以很容易的查询每一笔交易的所有流向。因为每一个节点都有整个系统的全部数据，同时所有的交易和区块都是严格绑定在一起的。</p>
        <p>区块链是一个分散的数据库，分散数据库记录了区块链每笔交易的输入输出，从而可以轻松的追踪资产数量变化和交易活动，这就是区块链的可追溯性。</p>
        <p>分散数据库，分散在网络链接的各台计算机上，不受中心化服务器控制。所以，区块链的数据存储方式是不可篡改的。我们可以追踪区块链中的数据，并且信赖这些数据，因为谁都无法改变它们，它们是真实的。</p>
    </div>
</template>
<script setup>


</script>
<style lang="less" scoped>
    .blockChain{
        .max1280();
        .marginAuto();
        text-align: left;
        h2{
            font-size: 28px;
            font-weight: 500;
            color: @green;
        }
        p{
            margin: 12px 0;
        }
        ul{
            margin-left: 24px;
        }
        .content-img{
            display: block;
            margin: 0 auto;
            width: 60%;
            border-radius:8px;
        }
        .strong{
            display: flex;
            align-items: center;
            justify-content: start;
            font-weight: 500;
            font-size: 20px;
            color: #609f49;
            margin-top: 32px;
            img{
                width: 20px;
                height: 20px;
                vertical-align: top;
                margin-right: 8px;
            }
        }
    }
</style>
  