<template>
    <div class="news">
        <ul>
            <li v-for="(item,index) in news_list" :key="index">
                <img :src="item.img" object-fit="cover" alt="news">
                <div class="text-box">
                    <p class="title">{{ item.title }}</p>
                    <p class="content">{{ item.content }}</p>
                </div>
            </li>
        </ul>
    </div>
</template>
<script setup>
  import img1 from '@/assets/img/xwdt2.png';
  import img2 from '@/assets/img/xwdt3.png';
  import img3 from '@/assets/img/xwdt4.png';
  import img4 from '@/assets/img/xwdt5.png';
  import { reactive } from 'vue';
  
      let news_list = reactive([
          {img: img1, title: '国家电网董事长辛保安：全力做好能源电力保供工作', content: '冀北电力有限公司检查迎峰度夏电力保供工作，看望慰问一 线干部员工。辛保安强调，当前正值迎峰度夏“七下八上” 的关键时期，要抓好电力冀北电力有限公司检查迎峰度夏电力保供工作，看望慰问一 线干部员工。辛保安强调，当前正值迎峰度夏“七下八上” 的关键时期，要抓好电力冀北电力有限公司检查迎峰度夏电力保供工作，看望慰问一 线干部员工。辛保安强调，当前正值迎峰度夏“七下八上” 的关键时期，要抓好电力 …'},
          {img: img2, title: '国家电网、国家电投、华能、华电等104家公司入选！2023《财富》中国500强榜单出炉！', content: '7月25日晚，2023《财富》中国500强榜单出炉！能源化工相关 企业有104家公司上榜。其中电力类有国家电网、南方电网、华 能、华电、三峡新能源等30家公司上榜；光伏类有隆基、通威、 天合、晶科、晶7月25日晚，2023《财富》中国500强榜单出炉！能源化工相关 企业有104家公司上榜。其中电力类有国家电网、南方电网、华 能、华电、三峡新能源等30家公司上榜；光伏类有隆基、通威、 天合、晶科、晶7月25日晚，2023《财富》中国500强榜单出炉！能源化工相关 企业有104家公司上榜。其中电力类有国家电网、南方电网、华 能、华电、三峡新能源等30家公司上榜；光伏类有隆基、通威、 天合、晶科、晶 …'},
          {img: img3, title: '国家电网： 以电网高质量发展为美丽中国建设赋能', content: '电网纵横神州，清洁电能留下绿色足迹，勾勒出经济社会低碳 转型的生动图景；建设绿色工程，加大生态系统保护力度，电 网与自然友好相处、与万物和谐共生的画卷徐徐铺展。建设生 态文明，关系人民福电网纵横神州，清洁电能留下绿色足迹，勾勒出经济社会低碳 转型的生动图景；建设绿色工程，加大生态系统保护力度，电 网与自然友好相处、与万物和谐共生的画卷徐徐铺展。建设生 态文明，关系人民福电网纵横神州，清洁电能留下绿色足迹，勾勒出经济社会低碳 转型的生动图景；建设绿色工程，加大生态系统保护力度，电 网与自然友好相处、与万物和谐共生的画卷徐徐铺展。建设生 态文明，关系人民福 …'},
          {img: img4, title: '国家电网公司62项工程荣获中国电力优质工程、23 项工程荣获电力行业绿色建造三星评价', content: '近日，2023年度中国电力优质工程评选和2022年度电力建设工程 绿色建造水平评价结果公布。国家电网有限公司62项工程荣获中 国电力优质工程、中国电力中小型优质工程，数量创历史之最； 23项工程荣获近日，2023年度中国电力优质工程评选和2022年度电力建设工程 绿色建造水平评价结果公布。国家电网有限公司62项工程荣获中 国电力优质工程、中国电力中小型优质工程，数量创历史之最； 23项工程荣获近日，2023年度中国电力优质工程评选和2022年度电力建设工程 绿色建造水平评价结果公布。国家电网有限公司62项工程荣获中 国电力优质工程、中国电力中小型优质工程，数量创历史之最； 23项工程荣获 …'},
      ])
</script>
<style lang="less" scoped>
    .news{
        .max1280();
        .marginAuto();
        ul{
            li{
                display: flex;
                align-items: center;
                margin: 24px 0;
                img{
                    flex-shrink: 0;
                    width: 370px;
                    height: 270px;
                    vertical-align: top;
                }
                .text-box{
                    margin-left: 30px;
                    text-align: left;
                    .title{
                        color: @green;
                        font-size: 20px;
                    }
                    .content{
                        font-size: 16px;
                    }
                }
            }
        }
    }
</style>
  